In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
# numpy and pandas - still preserves the index-value link
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
# Make a series from a python dict
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3 # automatically sorts in ascending orders

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
# Pass in dict keys in the order I want them
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
# Series automatically aligns by index label in arithmetic operations
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
# Series name attribute
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
# Alter a series in-place by assignment
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [27]:
################## Data Frames ##################
# Make a data frame from a dict of equal-length lists
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [28]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
# arrange cols
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
# df with missing values
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
# retrieve column, dict-like notation
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
# retrieve column, by attribute
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [34]:
# retrieve row with 'loc' attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
# Modify cols by assignment
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [36]:
# Modify cols by assignment
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], 
                index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [38]:
# Add col [of boolean values whether state is Ohio]
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [39]:
# delete columns
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
# Another data frame, this time a nested dict of dicts
pop = {'Nevada': {2001: 2.4, 2002:2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [42]:
# Transpose a df
frame3.T # same syntax as numpy arrays

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [43]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [45]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [46]:
# Return data as an array
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [47]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [48]:
# Resume 8/5/18 at page 134, section Index Objects
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [49]:
index[1:]

Index(['b', 'c'], dtype='object')

In [50]:
index[1]

'b'

In [51]:
# Index Objects, p. 134
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [52]:
index[1:]

Index(['b', 'c'], dtype='object')

In [53]:
index[1] = d #typeError. You can't modify index objects

NameError: name 'd' is not defined

In [ ]:
labels = pd.Index(np.arange(3))
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns # Columns are indexes

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
# Index can contain duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

In [ ]:
# Reindexing
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'a', 'b', 'c'])
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'],
                index = [0, 2, 4])
obj3

In [ ]:
obj3.reindex(range(6), method = 'ffill')

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a', 'c', 'd'],
                    columns = ['OH', 'TX', 'CA'])
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['TX', 'UT', 'CA']
frame.reindex(columns = states)

In [ ]:
fr ame.loc[['a', 'b', 'c', 'd'], states] # most users use this loc method

In [ ]:
# Dropping entries from an Axis
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

In [ ]:
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                   columns = ['one', 'two', 'three', 'four'])
data

In [ ]:
data.drop('Ohio') # drop row values

In [ ]:
# data.drop('two') # error
data.drop('two', axis = 1)

In [ ]:
data.drop(['two', 'four'], axis = 'columns')

In [ ]:
obj.drop('a', inplace = True) # don't show output
obj # this is dangerous though because the data dropped is gone

In [ ]:
# Indexing, selection, filtering - pg. 140
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

In [ ]:
obj['b'] # row

In [ ]:
obj[1] # row

In [ ]:
obj[2:4]

In [ ]:
obj[['b', 'a', 'd']]

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 2]

In [ ]:
obj['b':'c'] # slicing is inclusive, unlike 'normal' python

In [ ]:
obj['b':'c'] = 5
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                   columns = ['one', 'two', 'three', 'four'])
data

In [ ]:
data['two']

In [ ]:
data[['three', 'one']] # returns df

In [ ]:
data[:2] # first two rows

In [ ]:
data[data['three'] > 5] # can use boolean

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0 # change values < 5 to zero
data

In [ ]:
# Selection with loc and iloc
# special indexing operators loc and iloc let you 
# select subset of rows and cols from a df with numpy notation
data.loc['Colorado', ['two', 'three']] # by label

In [ ]:
data.iloc[2, [3, 0, 1]] # by integer location

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

In [ ]:
data.loc[: 'Utah', 'two']

In [ ]:
data.iloc[:, :3][data.three > 5]

In [ ]:
# Integer indexes - pg. 145
ser = pd.Series(np.arange(3.))
ser

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

In [ ]:
ser2[-1]

In [ ]:
ser[:1]

In [ ]:
ser2[:1]

In [ ]:
ser.loc[:1]

In [ ]:
# Arithmetic and data alignment [between objects with different indexes] - pg. 146
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
# When you are adding together objects, 
# if any index pairs are not the same, 
# the respective index in the result will be 
# the union of the index pairs
s1

In [ ]:
s2

In [ ]:
s1 + s2
# label locations with no matches get missing values

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Colorado'])
df1

In [ ]:
df2

In [ ]:
df1 + df2 # c and e do not exist in both dfs so you get missing values

In [ ]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

In [ ]:
df2

In [ ]:
df1 - df2 # no matching columns A and B in both dfs

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns = list('abcde'))
df1

In [ ]:
df2

In [ ]:
df2.loc[1, 'b'] = np.nan
df2

In [ ]:
df1 + df2

In [ ]:
df1.add(df2, fill_value=0)

In [ ]:
1 / df1

In [ ]:
df1.rdiv(1)

In [ ]:
df1.reindex(columns = df2.columns, fill_value = 0)

In [ ]:
# Operations between dataframe and series
arr = np.arange(12.).reshape((3, 4))
arr

In [ ]:
arr[1]

In [ ]:
arr - arr[0] # broadcasting

In [ ]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

In [ ]:
series = frame.iloc[0]
series

In [ ]:
frame - series

In [ ]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

In [ ]:
series3 = frame['d']
frame.sub(series3, axis='index')

In [ ]:
# Function application and mapping, pg. 151
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

In [ ]:
np.abs(frame)

In [ ]:
# applying a function on one-dimensional arrays
f = lambda x: x.max() - x.min()
frame.apply(f)

In [ ]:
frame.apply(f, axis = 'columns')

In [ ]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])
frame.apply(f)

In [ ]:
format = lambda x: '%.2f' % x
frame.applymap(format) # apply element-wise

In [54]:
# Sorting and Ranking, pg. 153
# Sort an object by its index with sort_index()
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index() # returns a new sorted object

a    1
b    2
c    3
d    0
dtype: int64

In [55]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index = [ 'three', 'one'],
                     columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [56]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [61]:
frame.sort_index(axis= 1) # begin sorting at different place

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [62]:
frame.sort_index(ascending = False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [66]:
# Sort by columns or values with sort_values
frame.sort_values(by = 'd', ascending = False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [71]:
# Ranking 
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() # breaks ties by assigning the average rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [69]:
obj.rank(method = 'first') # break ties by order of data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [72]:
obj.rank(ascending = False, method = 'max') # other methods are average, min, max, first, dense

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [74]:
# compute ranks in a dataframe
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5],
                     })
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [75]:
frame.rank(axis = 'columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [76]:
# Axis Indexes with Duplicate Labels, pg. 157
# Series
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'c', 'b'])
obj

a    0
a    1
b    2
c    3
b    4
dtype: int64

In [79]:
obj.index.is_unique

False

In [80]:
obj['a'] # iOutput type varies from indexing if there are dups; this returns a series

a    0
a    1
dtype: int64

In [81]:
obj['c']

3

In [84]:
# with Dataframe
df = pd.DataFrame(np.random.randn(4, 3), 
                 index = ['a', 'a','b','b'])
df

          0         1         2
a  0.998757 -0.779091 -0.087554
a  0.358768 -2.981444 -1.088703
b -1.685692 -0.022920  0.748185
b -0.554696  0.794433  0.539799

In [85]:
df.loc['b']

          0         1         2
b -1.685692 -0.022920  0.748185
b -0.554696  0.794433  0.539799

In [93]:
## 5.3 Summarizing and Computing Descriptive Statistics

df = pd.DataFrame([[1.4, np.nan],
                  [7.1, -4.5],
                  [np.nan, np.nan], 
                  [0.75, -1.3]],
                 index = ['a', 'b', 'c', 'd'],
                 columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [94]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [90]:
df.sum(axis='columns', skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [92]:
df.idxmax() # index value with max

one    b
two    d
dtype: object

In [95]:
#accumulation
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [96]:
df.describe() # like summary() in R

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [98]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [99]:
obj.describe() # Descriptions are ifferent for series

count     16
unique     3
top        a
freq       8
dtype: object

In [142]:
# Correlation and covariance, pg. 160
#conda install pandas-datareader # run in terminal

import pandas_datareader as pdr
mydata1 = pdr.get_data_fred('DEXCHUS') #  US/CAN exchange rate
mydata2 = pdr.get_data_fred('DEXUSEU') #  US/EU exchange rate
mydata3 = pdr.get_data_fred('DEXJPUS')
mydata = pd.concat([mydata1, mydata2, mydata3], axis = 1)
mydata.head()

#all_data = {ticker: web.get_data_yahoo(ticker)
#           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

            DEXCHUS  DEXUSEU  DEXJPUS
DATE
2010-01-01      NaN      NaN      NaN
2010-01-04   6.8273   1.4419    92.55
2010-01-05   6.8258   1.4402    91.48
2010-01-06   6.8272   1.4404    92.53
2010-01-07   6.8280   1.4314    93.31

In [143]:
mydata.tail()

            DEXCHUS  DEXUSEU  DEXJPUS
DATE
2018-09-24   6.8559   1.1773   112.62
2018-09-25   6.8632   1.1770   112.88
2018-09-26   6.8763   1.1758   112.92
2018-09-27   6.8880   1.1670   113.38
2018-09-28   6.8680   1.1622   113.48

In [144]:
mydata.describe()

           DEXCHUS      DEXUSEU      DEXJPUS
count  2193.000000  2193.000000  2193.000000
mean      6.447192     1.246371    99.957547
std       0.252177     0.113008    14.583167
min       6.040200     1.037500    75.720000
25%       6.225000     1.133200    83.980000
50%       6.380400     1.263900   102.200000
75%       6.655000     1.341400   111.720000
max       6.958000     1.487500   125.580000

In [145]:
returns = mydata.pct_change()
returns.tail()

             DEXCHUS   DEXUSEU   DEXJPUS
DATE
2018-09-24  0.000000  0.002896  0.000000
2018-09-25  0.001065 -0.000255  0.002309
2018-09-26  0.001909 -0.001020  0.000354
2018-09-27  0.001701 -0.007484  0.004074
2018-09-28 -0.002904 -0.004113  0.000882

In [136]:
# Correlation of daily % change in US/CAN exchange rate & US/EU exchange rate over the last 8 years
returns['DEXCHUS'].corr(returns['DEXUSEU'])

-0.2118079654177437

In [138]:
returns.DEXCHUS.corr(returns.DEXUSEU) # equivalent syntax

-0.2118079654177437

In [137]:
# Covariance of daily % change in US/CAN exchange rate & US/EU exchange rate over the last 8 years
returns['DEXCHUS'].cov(returns['DEXUSEU'])

-2.063105420161807e-06

In [146]:
returns.corr() # full matrix.

          DEXCHUS   DEXUSEU   DEXJPUS
DEXCHUS  1.000000 -0.211808  0.124047
DEXUSEU -0.211808  1.000000 -0.290072
DEXJPUS  0.124047 -0.290072  1.000000

In [147]:
mydata.corr()

          DEXCHUS   DEXUSEU   DEXJPUS
DEXCHUS  1.000000 -0.333212  0.016069
DEXUSEU -0.333212  1.000000 -0.745403
DEXJPUS  0.016069 -0.745403  1.000000

In [148]:
# Unique values/counts/membership, pg. 162
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [149]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [152]:
pd.value_counts(obj.values, sort = False)

c    3
a    3
d    1
b    2
dtype: int64

In [154]:
# filter down to subset with `isin`
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [155]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [156]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [159]:
# Compute histogram on multiple cols of a df
data = pd.DataFrame({'q1': [1, 3, 4, 3, 4],
                     'q2': [2, 3, 1, 2, 3],
                     'q3': [1, 5, 50, 4, 4]
                    })
result = data.apply(pd.value_counts).fillna(0)
result

     q1   q2   q3
1   1.0  1.0  1.0
2   0.0  2.0  0.0
3   2.0  2.0  0.0
4   2.0  0.0  2.0
5   0.0  0.0  1.0
50  0.0  0.0  1.0

# *the end of ch. 5*